#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.import_bucket: Refreshing state... [id=neptune-csv-import-bucket]
aws_neptune_cluster.neptune_cluster: Refreshing state... [id=neptune-cluster]
aws_neptune_cluster_instance.neptune_instance: Refreshing state... [id=tf-20230106133322789900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.neptune_role will be created
  + resource "aws_iam_role" "neptune_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "rds.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "neptune_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_neptune_cluster.neptune_cluster will be updated in-place
  ~ resource "aws_neptune_cluster" "neptune_cluster" {
      ~ iam_roles                            = [] -> (known after apply)
        id                                   = "neptune-cluster"
        tags                                 = {}
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ssm_parameter.neptune_endpoint will be created
  + resource "aws_ssm_parameter" "neptune_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "neptune_endpoint"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-1836c261"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + neptune_role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @gary-alway, Action: `pull_request`*